"john.appleseed" = "john.appleseed";
"Sign In" = "Kirjaudu sisään";
"Your account name or password was entered incorrectly." = "Syötettiin virheellinen käyttäjätunnus tai salasana.";
"There was an error logging in. Please try again." = "Virhe sisäänkirjauduttaessa. Yritä uudelleen.";
"Apple ID password" = "Apple ID -salasana";
"Invalid token data is returned by server" = "Virhe sisäänkirjauduttaessa. Yritä uudelleen.";
"Authentication was canceled by user" = "Todentaminen kumottiin";
"password" = "salasana";
"OK" = "OK";
"Password field is empty" = "Syötä salasana.";
"Password expired. Please change your password on Mac." = "Salasana vanhentunut. Vaihda salasana kohdassa Asetukset >Store";
"Required" = "Vaaditaan";
"Would you like to visit iForgot.apple.com to recover your %@?" = "Haluatko vierailla osoitteessa iForgot.apple.com ja palauttaa tilitietosi?";
"Password" = "Salasana";
"Apple ID field is empty" = "Apple ID -kenttä on tyhjä";
"Apple ID" = "Apple ID";
"Cancel" = "Kumoa";

/* Verification Code Screen Prompt */
"Enter verification code" = "Syötä vahvistuskoodi";

/* Verification Code Screen Title */
"Enter the Verification Code sent to %@" = "Syötä vahvistuskoodi, joka lähetettiin numeroon, joka päättyy %@";

/* Send new code button title */
"Send a new code" = "Lähetä uusi koodi";

/* SMS subtitle */
"SMS to Phone Number" = "Tekstiviesti puhelinnumeroon";

/* Unable Receive Messages Text */
"Unable to receive messages at any of your devices?" = "Etkö pysty vastaanottamaan viestejä mihinkään laitteeseesi?";

/* Verification Code Screen Title */
"Verification Code" = "Vahvistuskoodi";

/* Trusted devices screen title */
"Verify Identity" = "Vahvista henkilöllisyys";

/* Send button title */
"Send" = "Lähetä";

/* Trusted Devices List Footer Text */
"To manage your trusted devices visit %@ from a Mac or PC." = "Voit hallita luotettuja laitteitasi käymällä osoitteessa %@ Mac- tai Windows-tietokoneella.";

/* Trusted Devices List Header Title */
"Two-step verification is enabled for this Apple ID." = "Kaksivaiheinen vahvistus on otettu käyttöön tälle Apple ID:lle";

/* Trusted Devices List Header Text */
"The device you select below will be sent a temporary code that you can use to verify your identity." = "Alta valitsemaasi laitteeseen lähetetään tilapäinen koodi, jota voit käyttää henkilöllisyytesi vahvistamiseen.";

/* Trusted Devices section header */
"TRUSTED DEVICES" = "LUOTETUT LAITTEET";

/* Error Message */
"Two-step verification required, but user interaction is not allowed." = "Kaksivaiheinen vahvistus vaaditaan, mutta käyttäjän vuorovaikutusta ei sallita.";

/* Button title */
"My Apple ID…" = "Minun Apple ID:ni…";

/* Phone number description */
"Number ending in %@" = "numeroon, joka päättyy %@";

/* Error Message */
"Sorry, but you have made too many unsuccessful attempts to verify your identity. For security reasons, you will not be able to make changes to your account for the next eight hours without your Recovery Key." = "Pahoittelemme, mutta olet tehnyt liian monta epäonnistunutta yritystä henkilöllisyytesi vahvistamiseksi. Turvallisuussyistä et tämän vuoksi pysty tekemään muutoksia tiliisi seuraavaan kahdeksaan tuntiin ilman palautusavaintasi.";

/* Error Message */
"You have sent too many codes to verify your phone number. Please try again later." = "Olet lähettänyt liian monta koodia puhelinnumerosi vahvistamiseksi. Yritä myöhemmin uudelleen.";

/* Error Message */
"No Device information available." = "Laitetietoja ei saatavilla";

/* Error Message */
"The verification code you entered is not valid." = "Syöttämäsi vahvistuskoodi ei ole kelvollinen";

/* Error Message */
"You failed to verify the code too many times. Please send a new code to a different device or try again later." = "Koodin vahvistaminen epäonnistui liian monta kertaa. Lähetä uusi koodi eri laitteeseen tai yritä myöhemmin uudelleen.";

/* New Localized Strings. Added in ACME 2.1.6 */
"Your Apple ID or password was entered incorrectly." = "Apple ID:si tai salasanasi syötettiin väärin";

"To protect your security, it’s time to reset your password. It’s easy, just go to %@." = "Turvallisuutesi vuoksi on aika nollata salasanasi. Se käy helposti osoitteessa %@.";

"This Apple ID has been disabled for security reasons. You can reset your password at %@." = "Tämä Apple ID on turvallisuussyistä poistettu käytöstä. Voit nollata salasanasi osoitteessa %@.";

"The current time on this device seems to be incorrect. You can fix it by going to Settings > General > Date & Time, then try again." = "Tämän laitteen aika näyttää olevan virheellinen. Voit korjata sen avaamalla Asetukset > Yleiset > Päivä ja aika. Yritä sitten uudelleen.";

"Oops, an error occurred. Thanks for your patience, please try again later." = "Tapahtui virhe. Kiitos kärsivällisyydestäsi, yritä myöhemmin uudelleen.";

"You appear to be offline. Please connect to the Internet and try again." = "Et näytä olevan verkkoyhteydessä. Yhdistä Internetiin ja yritä uudelleen.";

"Two-step verification has been disabled for the Apple ID account %@." = "Kaksivaiheinen vahvistus on poistettu käytöstä Apple ID -tilille %@.";

"Signing In" = "Kirjaudutaan sisään";

"A new code has been sent to your device." = "Laitteeseesi on lähetetty uusi koodi.";

"Code %1$d of %2$d selected" = "Koodi %1$d/%2$d valittu";

"Sending New Code" = "Lähetetään uusi koodi";

"Verifying code" = "Vahvistetaan koodia";

"Verified" = "Vahvistettu";

/* Send Code to label */
"Send Code to:" = "Lähetä koodi laitteeseen:";

/* Error Message */
"Please enter a valid phone number." = "Syötä kelvollinen puhelinnumero.";

